backend/controllers/JcfmUnder18Controller.php

SELECT COUNT(*) FROM `daerah_lookup` WHERE `id_negeri`='13'
SELECT * FROM `daerah_lookup` WHERE `id_negeri`='13'
---
    public function actionLists($id){

        $daerahCount = \backend\models\DaerahLookup::find()
                ->where(['id_negeri'=>$id])
                ->count();

        $daerah = \backend\models\DaerahLookup::find()
                ->where(['id_negeri'=>$id])
                ->all();

SELECT * FROM `jcfm_under_18` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = JcfmUnder18::findOne($id)) !== null) {