backend/views/jcfm-above18/_form.php

SELECT * FROM `negeri`
SELECT * FROM `daerah_lookup` WHERE `id_negeri` IS NULL
---

    <?= $form->field($model, 'poskod')->textInput() ?>

    <?= $form->field($model, 'negeri')->dropDownList(
        ArrayHelper::map(Negeri::find()->all(),'id','senarai_negeri'),
        ['prompt'=>'Sila Pilih',
        'onchange'=>
            '$.post("index.php?r=jcfm-under18/lists&id='.'"+$(this).val(),
                function(data){$("select#daerahList").html(data);
            })'
        ]) ?>

    <?= $form->field($model, 'daerah')->dropDownList(
        ArrayHelper::map(DaerahLookup::find()->where(
            ['id_negeri'=>$model->id])->asArray()->all(),'daerah', 'senarai_daerah'),
            ['prompt' => 'Sila Pilih', 'id'=>'daerahList']) ?>